Revit 2026 API

# IPrintSetting Properties

---

The IPrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrintParameters | Returns the Parameters of Print Setup. |

#### Reference

IPrintSetting Interface

Autodesk.Revit.DB Namespace